In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [3]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                   'dataset1': np.random.randn(5),
                   'dataset2': np.random.randn(5)})

In [4]:
dframe

   dataset1  dataset2 k1     k2
0 -0.481872  0.837532  X  alpha
1  0.448363  2.078182  X   beta
2 -1.899980 -0.689619  Y  alpha
3 -0.729773  0.766670  Y   beta
4 -0.501301  0.473675  Z  alpha

In [5]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [6]:
group1

In [7]:
group1.mean()

k1
X   -0.016754
Y   -1.314877
Z   -0.501301
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [9]:
dframe

   dataset1  dataset2 k1     k2
0 -0.481872  0.837532  X  alpha
1  0.448363  2.078182  X   beta
2 -1.899980 -0.689619  Y  alpha
3 -0.729773  0.766670  Y   beta
4 -0.501301  0.473675  Z  alpha

In [10]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB    0.448363
    JAN   -1.899980
NY  FEB   -0.729773
    JAN   -0.491586
Name: dataset1, dtype: float64

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.016754  1.457857
Y  -1.314877  0.038526
Z  -0.501301  0.473675

In [13]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.481872  0.837532
   beta   0.448363  2.078182
Y  alpha -1.899980 -0.689619
   beta  -0.729773  0.766670
Z  alpha -0.501301  0.473675

In [19]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]

In [20]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.837532
   beta   2.078182
Y  alpha -0.689619
   beta   0.766670
Z  alpha  0.473675

In [21]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [28]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0 -0.481872  0.837532  X  alpha
1  0.448363  2.078182  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -1.899980 -0.689619  Y  alpha
3 -0.729773  0.766670  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.501301  0.473675  Z  alpha

In [25]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print('Key1={} Key2={} group'.format(k1, k2))
    print(group)
    print('\n')

Key1=X Key2=alpha group
   dataset1  dataset2 k1     k2
0 -0.481872  0.837532  X  alpha


Key1=X Key2=beta group
   dataset1  dataset2 k1    k2
1  0.448363  2.078182  X  beta


Key1=Y Key2=alpha group
   dataset1  dataset2 k1     k2
2  -1.89998 -0.689619  Y  alpha


Key1=Y Key2=beta group
   dataset1  dataset2 k1    k2
3 -0.729773   0.76667  Y  beta


Key1=Z Key2=alpha group
   dataset1  dataset2 k1     k2
4 -0.501301  0.473675  Z  alpha

In [26]:
gr = dframe.groupby('k1')

In [27]:
gr.get_group('X')

   dataset1  dataset2 k1     k2
0 -0.481872  0.837532  X  alpha
1  0.448363  2.078182  X   beta

In [29]:
group_dict = dict(list(dframe.groupby('k1')))

In [30]:
group_dict['X']

   dataset1  dataset2 k1     k2
0 -0.481872  0.837532  X  alpha
1  0.448363  2.078182  X   beta

In [32]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [33]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.481872  0.837532
 1  0.448363  2.078182
 2 -1.899980 -0.689619
 3 -0.729773  0.766670
 4 -0.501301  0.473675, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}